index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Lambda Nights</title>
<!-- 2015-03-26 Thu 20:06 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Nathan Burgers" />
<link rel="stylesheet" type="text/css" href="assets/style.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Lambda Nights</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Night 1: Introduction to Standard-ML</a></li>
<li><a href="#sec-2">Night 2: Coming Next Week&#x2026;</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Night 1: Introduction to Standard-ML</h2>
<div class="outline-text-2" id="text-1">
<p>
Before we get started please install a Standard-ML interpreter like the
<a href="http://smlnj.org">Standard-ML of New Jersey</a>, or alternatively you can edit Standard-ML
online <a href="http://www.tutorialspoint.com/execute_smlnj_online.php">at this website</a>.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Expressions</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<b>Expressions</b> are the basic unit of computation in <b>Standard-ML</b>. They
include typical mathematical expressions like <code>2 + 2</code>, <code>(1 + 1) / 4</code>, and
function calls like <code>size( "Hello World!" )</code>. Note that in <b>Standard-ML</b>
the parenthesis around a function call are not necessary, so we can write
<code>size( "Hello World!" )</code> simply as
</p>
<div class="org-src-container">

<pre class="src src-sml">size "Hello World!"
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Values</h3>
<div class="outline-text-3" id="text-1-2">
<p>
<b>Values</b> in <b>Standard-ML</b> are a lot like <b>Variables</b> in other languages,
only they cannot change over time. If we want to store the result of
an expression in a value named <code>foo</code> then we may write
</p>
<div class="org-src-container">

<pre class="src src-sml">val foo = 2 + 2
</pre>
</div>
<p>
Note that unlike many other languages there is no need to insert a semicolon
to denote the end of the definition of <code>foo</code>. In fact you will almost never
see a semicolon in idiomatic <b>Standard-ML</b>.
</p>

<p>
If you entered the above code into an interpreter then it is likely you
saw output similar to <code>val foo : int = 4</code>. This colon after the name of
the value denotes its <i>type</i>.
</p>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">Value Types</h3>
<div class="outline-text-3" id="text-1-3">
<p>
All values and expressions in <b>Standard-ML</b>
have a type. We can be explicit about the type of a value, for instance,
we can say
</p>
<div class="org-src-container">

<pre class="src src-sml">val greeting : string = "Hello World!"
</pre>
</div>
<p>
which declares a value named <code>greeting</code> of type <code>string</code> that contains the
string "Hello World". We use colons to denote that we
are being explicit about the type of a value.
</p>

<p>
But how does <b>Standard-ML</b> know that <code>foo</code> has type <code>int</code>? That is thanks to
one of its most powerful features, called <i>Type Inference</i>. <b>Standard-ML</b> is
actually smart enough to figure out the type of <i>any code you can give it</i>.
</p>

<p>
This means that you never have to explicitly tell <b>Standard-ML</b> what type
you want something to be, it will simply figure it out. However, many
programmers choose to explicitly state the type of value to document
their code.
</p>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">Functions</h3>
<div class="outline-text-3" id="text-1-4">
<p>
<b>Functions</b> in <b>Standard-ML</b> are a lot like functions in <b>C</b> or methods in 
<b>Java</b>. Note that <b>Standard-ML</b> is <i>not</i> an Object-Oriented language and
does not have true <i>objects</i> or <i>methods</i>. However, I think you'll find
that we can get along just as well without them.
</p>

<p>
We can define a function like this
</p>
<div class="org-src-container">

<pre class="src src-sml">fun double (x) = 2 * x
</pre>
</div>
<p>
Or alternatively, without the parenthesis around <code>x</code> as
</p>
<div class="org-src-container">

<pre class="src src-sml">fun double x = 2 * x
</pre>
</div>
<p>
We can also choose to be very explicit about the type of the function
</p>
<div class="org-src-container">

<pre class="src src-sml">fun double (x : int) : int = 2 * x
</pre>
</div>
<p>
Which explicitly defines <code>double</code> as a function that takes an integer <code>x</code>
as input, and returns an integer value.
</p>

<p>
Every one of the above 3 definitions is equivalent, and makes no difference
to the language which you choose to use. Note that, in the industry, programmers
tend to prefer the second style, which has the least amount of syntactic clutter.
</p>

<p>
the type of a <i>function</i> from integers to integers is <code>int -&gt; int</code>. <b>Standard-ML</b>
uses the infix symbol <code>-&gt;</code> to mean "function".
</p>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5">Pattern Matching</h3>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6">Function Pattern Matching</h3>
</div>

<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7">Tuples</h3>
<div class="outline-text-3" id="text-1-7">
<p>
Since <b>Standard-ML</b> does not have a way to define objects, we need another
way of packing related pieces of data together. Enter the <i>tuple</i>. Tuples
look like the following
</p>
<div class="org-src-container">

<pre class="src src-sml">val a_tuple = (2, 3)
</pre>
</div>
<p>
which denotes a tuple containing a 2 and a 3. Tuples are <i>ordered</i> and we have
ordered ways of accessing their elements, like this
</p>
<div class="org-src-container">

<pre class="src src-sml">val a_tuple = (3, 2)
val first_element = #1 a_tuple
val second_element = #2 a_tuple
</pre>
</div>
<p>
after evaluating this code, <code>first_element</code> will be equal to 2, and <code>second_element</code> will
be equal to 3. Note that trying to evaluate <code>#3 a_tuple</code> will result in a compilation
failure.
</p>

<p>
The type of a tuple of 2 integers is <code>int * int</code>, where the asterisk is meant to look
like the cartesian product symbol from math. Tuples can have elements of different
types, like <code>("March", 3)</code>, which has type <code>string * int</code>.
</p>

<p>
Tuples can also have more than one element, for instance, the tuple <code>("March", 3, 2015)</code>,
which has type <code>string * int * int</code>, is a 3-tuple. We could easily create tuples of more
elements.
</p>
</div>
</div>

<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8">Algebraic Data Types</h3>
<div class="outline-text-3" id="text-1-8">
<p>
<b>Algebraic Data Types</b> give us a way of saying that an element of a type may take one
of multiple forms. We use the word <code>datatype</code> to define a new <b>ADT</b>.
</p>
<div class="org-src-container">

<pre class="src src-sml">datatype Boolean = True | False
</pre>
</div>
<p>
which defines 2 values, <code>True</code> and <code>False</code>, that both belong to the <code>Boolean</code> type.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Night 2: Coming Next Week&#x2026;</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Nathan Burgers</p>
<p class="date">Created: 2015-03-26 Thu 20:06</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
